BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
void flashExito() {
  for (int i = 0; i < 2; i++) {
    digitalWrite(FLASH_PIN, HIGH); delay(150);
    digitalWrite(FLASH_PIN, LOW);  delay(150);
  }
}

void flashError() {
  digitalWrite(FLASH_PIN, HIGH); delay(800);
  digitalWrite(FLASH_PIN, LOW);
}

bool resultadoAsistenciaExitosa(const String& resultado) {
  return resultado.indexOf(" OK: ") >= 0;
}

unsigned long getTimestamp() {
  if (bootEpoch > 0) return bootEpoch + millis() / 1000;
  return millis() / 1000;
}

void actualizarBloqueoAsistencia(unsigned long duracionMs) {
  unsigned long nuevoBloqueo = millis() + duracionMs;
  if (nuevoBloqueo > bloqueoAsistenciaHasta) bloqueoAsistenciaHasta = nuevoBloqueo;
}

bool asistenciaAutomaticaHabilitada(unsigned long ahora) {
  return motivoAsistenciaAutomatica(ahora) == "habilitada";
}

bool datosOfflineListos(String& motivo) {
  DynamicJsonDocument docPersonas(2048);
  JsonArray personas = loadArray("/personas.json", docPersonas);
  if (personas.size() == 0) {
    motivo = "sin_personas_locales";
    return false;
  }

  DynamicJsonDocument docAsignaciones(1024);
  JsonArray asignaciones = loadArray("/asignaciones.json", docAsignaciones);
  if (asignaciones.size() == 0) {
    motivo = "sin_asignaciones_locales";
    return false;
  }

  motivo = "habilitada";
  return true;
}

String motivoAsistenciaAutomatica(unsigned long ahora) {
  if (estadoActual != ESTADO_IDLE) return "sistema_ocupado";
  if (ahora - cooldownAsistencia <= COOLDOWN_TIEMPO) return "cooldown";
  if (ahora < bloqueoAsistenciaHasta) return "bloqueo_menu";

  if (!isOnline) {
    String motivo = "";
    if (!datosOfflineListos(motivo)) return motivo;
    return "habilitada";
  }
  return "habilitada";
}
uint32_t calcularFirmaMovimiento(const uint8_t* data, size_t len) {
  if (!data || len == 0) return 0;
  const size_t muestras = 128;
  size_t salto = len / muestras;
  if (salto == 0) salto = 1;

  uint32_t acumulador = 0;
  for (size_t i = 0, tomadas = 0; i < len && tomadas < muestras; i += salto, tomadas++) {
    acumulador += data[i];
  }
  return acumulador;
}

String jsonEscape(const String& src) {
  String out = "";
  out.reserve(src.length() + 8);
  for (size_t i = 0; i < src.length(); i++) {
    char c = src[i];
    if (c == '\\') out += "\\\\";
    else if (c == '"') out += "\\\"";
    else if (c == '\n') out += "\\n";
    else if (c == '\r') out += "\\r";
    else if (c == '\t') out += "\\t";
    else out += c;
  }
  return out;
}

// ============================================================
// CAMARA
// ============================================================
void initCamera() {
  camera_config_t config;
  config.ledc_channel  = LEDC_CHANNEL_0;
  config.ledc_timer    = LEDC_TIMER_0;
  config.pin_d0        = 5;
  config.pin_d1        = 18;
  config.pin_d2        = 19;
  config.pin_d3        = 21;
  config.pin_d4        = 36;
  config.pin_d5        = 39;
  config.pin_d6        = 34;
  config.pin_d7        = 35;
  config.pin_xclk      = 0;
  config.pin_pclk      = 22;
  config.pin_vsync     = 25;
  config.pin_href      = 23;
  config.pin_sscb_sda  = 26;
  config.pin_sscb_scl  = 27;
  config.pin_pwdn      = 32;
  config.pin_reset     = -1;
  config.xclk_freq_hz  = 20000000;
  config.pixel_format  = PIXFORMAT_JPEG;
  config.frame_size    = FRAMESIZE_VGA;
  config.jpeg_quality  = 8;
  config.fb_count      = 1;

  if (esp_camera_init(&config) == ESP_OK) {
    camaraIniciada = true;
    addLog("Camara iniciada");
    baselineMovimientoLista = false;
  } else {
    addLog("Error iniciando camara");
  }

  sensor_t * s = esp_camera_sensor_get();
  s->set_brightness(s, 1);
  s->set_contrast(s, 1);
  s->set_special_effect(s, 0);
  s->set_vflip(s, 0);
  s->set_hmirror(s, 1);
}


String capturarImagenBase64() {
  if (!camaraIniciada) return "";

  digitalWrite(FLASH_PIN, HIGH);
  delay(200);

  camera_fb_t* fb = esp_camera_fb_get();

  digitalWrite(FLASH_PIN, LOW);
  delay(150);
  if (!fb) {
    addLog("Error: Falla al capturar frame");
    return "";
  }

  const char* b64chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  String encoded = "";
  encoded.reserve((fb->len * 4 / 3) + 2);

  int i = 0;
  unsigned char buf3[3], buf4[4];
  int len = fb->len;
  uint8_t* data = fb->buf;

  while (len--) {
    buf3[i++] = *(data++);
    if (i == 3) {
      buf4[0] = (buf3[0] & 0xfc) >> 2;
      buf4[1] = ((buf3[0] & 0x03) << 4) + ((buf3[1] & 0xf0) >> 4);
      buf4[2] = ((buf3[1] & 0x0f) << 2) + ((buf3[2] & 0xc0) >> 6);
      buf4[3] = buf3[2] & 0x3f;
      for (i = 0; i < 4; i++) encoded += b64chars[buf4[i]];
      i = 0;
    }
  }

  if (i > 0) {
    for (int j = i; j < 3; j++) buf3[j] = '\0';
    buf4[0] = (buf3[0] & 0xfc) >> 2;
    buf4[1] = ((buf3[0] & 0x03) << 4) + ((buf3[1] & 0xf0) >> 4);
    buf4[2] = ((buf3[1] & 0x0f) << 2) + ((buf3[2] & 0xc0) >> 6);
    buf4[3] = buf3[2] & 0x3f;
    for (int j = 0; j < i + 1; j++) encoded += b64chars[buf4[j]];
    while (i++ < 3) encoded += '=';
  }

  esp_camera_fb_return(fb);

  return encoded;
}
// ============================================================
// WIFI Y MANTENIMIENTO MQTT
// ============================================================
void tryConnectWiFi() {
  if (savedSSID.length() == 0) {
    isOnline = false;
    return;
  }
  addLog("Conectando WiFi: " + savedSSID);

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  esp_wifi_set_ps(WIFI_PS_NONE);

  IPAddress dns(8, 8, 8, 8);
  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, dns);

  WiFi.begin(savedSSID.c_str(), savedPASS.c_str());

  int intentos = 0;
  while (WiFi.status() != WL_CONNECTED && intentos < 20) {
    delay(500);
    Serial.print(".");
    intentos++;
  }
  Serial.println();
  isOnline = (WiFi.status() == WL_CONNECTED);

  if (isOnline) {
    addLog("WiFi conectado");
    deviceMAC = WiFi.macAddress();
    deviceMAC.replace(":", "");
    addLog("MAC: " + deviceMAC);
    wifiEstabaConectado = true;
    enrolarDispositivo();
  } else {
    addLog("WiFi no disponible");
    wifiEstabaConectado = false;
    WiFi.disconnect();
  }
}

int reintentosWifi = 0;
unsigned long ultimoIntentoWifi = 0;

