BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
void verificarConexionWiFi() {
  if (savedSSID.length() == 0) return;

  if (WiFi.status() == WL_CONNECTED) {
    isOnline = true;
    reintentosWifi = 0;
    return;
  }

  if (!wifiEstabaConectado) return;

  isOnline = false;
  unsigned long ahora = millis();
  if (reintentosWifi > 0 && (ahora - ultimoIntentoWifi) < (reintentosWifi * 3000UL)) return;

  reintentosWifi++;
  ultimoIntentoWifi = ahora;
  addLog("WiFi perdido. Intento " + String(reintentosWifi) + "/5...");

  WiFi.reconnect();

  int espera = 0;
  while (WiFi.status() != WL_CONNECTED && espera < 40) {
    delay(250);
    espera++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    isOnline = true;
    reintentosWifi = 0;
    addLog("WiFi reconectado");
    if (mqtt_client != NULL) {
      esp_mqtt_client_stop(mqtt_client);
      esp_mqtt_client_destroy(mqtt_client);
      mqtt_client = NULL;
      mqttConnected = false;
    }
  } else if (reintentosWifi >= 5) {
    addLog("5 intentos fallidos. Cambiando a modo AP...");
    WiFi.disconnect(true);
    delay(500);
    WiFi.mode(WIFI_AP);
    WiFi.softAP(apSSID, apPASS, 1, 0, 4);
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
    addLog("AP activo: 192.168.4.1");
    wifiEstabaConectado = false;
    reintentosWifi = 0;
  }
}

void mantenerConexionMQTT() {
  if (mqttBroker == "" || !isOnline) return;
  if (mqtt_client != NULL) return;

  String brokerUrl = mqttBroker;
  bool tieneEsquema = brokerUrl.startsWith("mqtt://") || brokerUrl.startsWith("ws://") || brokerUrl.startsWith("wss://") ||
                     brokerUrl.startsWith("http://") || brokerUrl.startsWith("https://");

  if (!tieneEsquema) {
    if (brokerUrl.indexOf(":") == -1) brokerUrl += ":1883";
    brokerUrl = "mqtt://" + brokerUrl;
  } else {
    if (brokerUrl.startsWith("http://")) brokerUrl = "ws://" + brokerUrl.substring(7);
    else if (brokerUrl.startsWith("https://")) brokerUrl = "wss://" + brokerUrl.substring(8);

    if (brokerUrl.startsWith("ws://") || brokerUrl.startsWith("wss://")) {
      if (!brokerUrl.endsWith("/mqtt")) brokerUrl += brokerUrl.endsWith("/") ? "mqtt" : "/mqtt";
    }
  }

  addLog("Conectando MQTT: " + brokerUrl);
  esp_mqtt_client_config_t mqtt_cfg = {};

  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    mqtt_cfg.broker.address.uri = brokerUrl.c_str();
    if (brokerUrl.startsWith("wss://")) {
      mqtt_cfg.broker.verification.crt_bundle_attach = esp_crt_bundle_attach;
    }
  #else
    mqtt_cfg.uri = brokerUrl.c_str();
    if (brokerUrl.startsWith("wss://")) {
      mqtt_cfg.crt_bundle_attach = esp_crt_bundle_attach;
    }
  #endif

  String lwtTopic = "esp32/lwt/" + deviceMAC;
  String lwtMsg = "{\"mac\":\"" + deviceMAC + "\",\"estado\":\"inactivo\"}";
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    mqtt_cfg.session.last_will.topic = lwtTopic.c_str();
    mqtt_cfg.session.last_will.msg = lwtMsg.c_str();
    mqtt_cfg.session.last_will.msg_len = lwtMsg.length();
    mqtt_cfg.session.last_will.qos = 0;
    mqtt_cfg.session.last_will.retain = 0;
  #else
    mqtt_cfg.lwt_topic = lwtTopic.c_str();
    mqtt_cfg.lwt_msg = lwtMsg.c_str();
    mqtt_cfg.lwt_msg_len = lwtMsg.length();
    mqtt_cfg.lwt_qos = 0;
    mqtt_cfg.lwt_retain = 0;
  #endif

  mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
  esp_mqtt_client_register_event(mqtt_client, (esp_mqtt_event_id_t)ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
  esp_mqtt_client_start(mqtt_client);
}

void enrolarDispositivo() {
  if (pinEnrol.length() == 0 || estaEnrolado) return;
  addLog("Enrolando dispositivo con PIN: " + pinEnrol);
  HTTPClient http;
  beginHttp(http, backendURL + "/api/dispositivos/enrolar");
  http.addHeader("Content-Type", "application/json");


  String macConDosPuntos = WiFi.macAddress();
  DynamicJsonDocument doc(256);
  doc["codigo"] = pinEnrol;
  doc["mac"] = macConDosPuntos;
  doc["ip"] = WiFi.localIP().toString();
  String payload;
  serializeJson(doc, payload);

  int code = http.POST(payload);
  if (code == 200) {
    addLog("Dispositivo enrolado correctamente");
    estaEnrolado = true;
    pinEnrol = "";
    String ssid = savedSSID, pass = savedPASS, backend = backendURL, mqtt = mqttBroker;
    saveConfig(ssid, pass, backend, mqtt, "");
  } else {
    addLog("Error enrolando: HTTP " + String(code) + " " + http.getString());
  }
  http.end();
}

void beginHttp(HTTPClient& http, const String& url) {
  http.begin(url);
  http.setTimeout(10000);
  if (deviceMAC.length() > 0) http.addHeader("X-Device-MAC", deviceMAC);
}

void sincronizarPersonasDesdeBackend() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) {
    addLog("Sin WiFi: No se puede fetchear personas.");
    return;
  }
  addLog("Fetcheando lista de personas desde Backend...");
  HTTPClient http;
  beginHttp(http, backendURL + "/api/personas");

  int httpCode = http.GET();
  if (httpCode == 200) {
    DynamicJsonDocument doc(8192);
    DeserializationError error = deserializeJson(doc, http.getStream());

    if (!error) {
      File file = SPIFFS.open("/personas.json", "w");
      serializeJson(doc, file);
      file.close();
      addLog("Personas fetcheadas y guardadas. Total: " + String(doc.size()));
    } else {
      addLog("Error parseando JSON de personas.");
    }
  } else {
    addLog("Error HTTP al fetchear personas: " + String(httpCode));
  }
  http.end();
  yield();
}

// ============================================================
// LOGICA DE ASISTENCIA FACIAL
// ============================================================
String identificarPorRostro() {
  if (!camaraIniciada || !isOnline || WiFi.status() != WL_CONNECTED) {
    return "";
  }

  String imgBase64 = capturarImagenBase64();

  if (imgBase64.length() == 0) {
    return "";
  }

  String payload = "{\"imagen\":\"" + imgBase64 + "\"}";

  HTTPClient http;
  beginHttp(http, backendURL + "/api/facial/identificar");
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(8000);

  int httpCode = http.POST(payload);
  String personaIdEncontrada = "";

  if (httpCode == 200) {
    DynamicJsonDocument doc(256);
    deserializeJson(doc, http.getString());
    if (doc.containsKey("persona_id")) {
      personaIdEncontrada = doc["persona_id"].as<String>();
    }
  } else {
    addLog("Identificacion fallida, Codigo HTTP: " + String(httpCode));
  }

  http.end();
  return personaIdEncontrada;
}

