BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
  esp_mqtt_client_publish(mqtt_client, "esp32/imagen/start", personaId.c_str(), 0, 1, 0);
  delay(100);

  int chunkSize = 1024;
  int longitudTotal = imgBase64.length();
  for (int i = 0; i < longitudTotal; i += chunkSize) {
    String chunk = imgBase64.substring(i, min(i + chunkSize, longitudTotal));
    esp_mqtt_client_publish(mqtt_client, "esp32/imagen/part", chunk.c_str(), 0, 1, 0);
    delay(200);
    yield();
  }

  esp_mqtt_client_publish(mqtt_client, "esp32/imagen/end", "fin", 0, 1, 0);
  return true;
}

void sincronizarAsistencias() {
  if (!isOnline) return;
  DynamicJsonDocument doc(2048);
  JsonArray asist = loadArray("/asistencias.json", doc);

  bool hayPendientes = false;
  for (JsonObject a : asist) {
    if (a["sincronizado"] == false) { hayPendientes = true; break; }
  }
  if (!hayPendientes) return;

  DynamicJsonDocument payload(2048);
  JsonArray registros = payload.createNestedArray("registros");
  for (JsonObject a : asist) {
    if (a["sincronizado"] == false) {
      JsonObject r = registros.createNestedObject();
      r["persona_id"] = a["persona_id"];
      r["nombre"]     = a["nombre"];
      r["tipo"]       = a["tipo"];
      r["metodo"]     = a["metodo"];
    }
  }
  String body; serializeJson(payload, body);

  HTTPClient http;
  beginHttp(http, backendURL + "/api/asistencias/sync");
  http.addHeader("Content-Type", "application/json");

  int code = http.POST(body);
  http.end();

  if (code == 200) {
    for (JsonObject a : asist) a["sincronizado"] = true;
    saveArray("/asistencias.json", doc);
    addLog("Sincronizacion completada");
  }
}

void sincronizarTurnosPendientes() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) return;

  DynamicJsonDocument doc(8192);
  JsonArray turnos = loadArray("/turnos.json", doc);
  bool huboCambios = false;

  for (JsonObject t : turnos) {
    bool sincronizado = t.containsKey("sincronizado") ? t["sincronizado"].as<bool>() : false;
    String backendId = t.containsKey("backend_id") ? t["backend_id"].as<String>() : "";
    if (sincronizado && backendId.length() > 0) continue;

    String nuevoId = "";
    if (crearTurnoEnBackend(
      t["nombre"].as<String>(),
      t["inicio"].as<String>(),
      t["fin"].as<String>(),
      t["dias"].as<String>(),
      nuevoId
    )) {
      if (nuevoId.length() > 0) {
        t["backend_id"] = nuevoId;
        t["sincronizado"] = true;
        huboCambios = true;
      }
    }
  }

  if (huboCambios) {
    saveArray("/turnos.json", doc);
    addLog("Turnos pendientes sincronizados");
  }
}

void sincronizarAsignacionesPendientes() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) return;

  DynamicJsonDocument doc(8192);
  JsonArray asignaciones = loadArray("/asignaciones.json", doc);
  bool huboCambios = false;

  for (JsonObject a : asignaciones) {
    bool sincronizado = a.containsKey("sincronizado") ? a["sincronizado"].as<bool>() : false;
    if (sincronizado) continue;

    String personaId = a["persona_id"].as<String>();
    if (personaId.startsWith("local-")) continue;

    String turnoBackendId = obtenerTurnoBackendId(a["turno_id"].as<String>());
    if (turnoBackendId.length() == 0) continue;

    String asigBackendId = "";
    if (crearAsignacionEnBackend(personaId, turnoBackendId, asigBackendId)) {
      a["sincronizado"] = true;
      if (asigBackendId.length() > 0) a["backend_id"] = asigBackendId;
      huboCambios = true;
    }
  }

  if (huboCambios) {
    saveArray("/asignaciones.json", doc);
    addLog("Asignaciones pendientes sincronizadas");
  }
}

void sincronizarTurnosDesdeBackend() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) return;

  DynamicJsonDocument docLocal(8192);
  JsonArray turnosLocales = loadArray("/turnos.json", docLocal);
  for (JsonObject t : turnosLocales) {
    bool sincronizado = t.containsKey("sincronizado") ? t["sincronizado"].as<bool>() : false;
    if (!sincronizado) {
      addLog("Turnos locales pendientes detectados, se omite sobreescritura desde backend");
      return;
    }
  }

  HTTPClient http;
  beginHttp(http, backendURL + "/api/turnos");

  int code = http.GET();
  if (code != 200) {
    addLog("Error HTTP al fetchear turnos: " + String(code));
    http.end();
    return;
  }

  DynamicJsonDocument doc(8192);
  DeserializationError error = deserializeJson(doc, http.getStream());
  http.end();
  if (error || !doc.is<JsonArray>()) {
    addLog("Error parseando JSON de turnos.");
    return;
  }

  JsonArray arr = doc.as<JsonArray>();
  for (JsonObject t : arr) {
    String id = t["id"].as<String>();
    t["backend_id"] = id;
    t["sincronizado"] = true;
  }
  saveArray("/turnos.json", doc);
}

void sincronizarAsignacionesDesdeBackend() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) return;

  DynamicJsonDocument docLocal(8192);
  JsonArray asignLocales = loadArray("/asignaciones.json", docLocal);
  for (JsonObject a : asignLocales) {
    bool sincronizado = a.containsKey("sincronizado") ? a["sincronizado"].as<bool>() : false;
    if (!sincronizado) {
      addLog("Asignaciones locales pendientes detectadas, se omite sobreescritura desde backend");
      return;
    }
  }

  HTTPClient http;
  beginHttp(http, backendURL + "/api/asignaciones");

  int code = http.GET();
  if (code != 200) {
    addLog("Error HTTP al fetchear asignaciones: " + String(code));
    http.end();
    return;
  }

  DynamicJsonDocument doc(12288);
  DeserializationError error = deserializeJson(doc, http.getStream());
  http.end();
  if (error || !doc.is<JsonArray>()) {
    addLog("Error parseando JSON de asignaciones.");
    return;
  }

  JsonArray arr = doc.as<JsonArray>();
  for (JsonObject a : arr) {
    a["backend_id"] = a["id"].as<String>();
    a["sincronizado"] = true;
  }
  saveArray("/asignaciones.json", doc);
}

void sincronizarErpConfigDesdeBackend() {
  if (!isOnline || WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  beginHttp(http, backendURL + "/api/dispositivos/erp-config");
  int code = http.GET();
  if (code == 200) {
    DynamicJsonDocument doc(4096);
    DeserializationError error = deserializeJson(doc, http.getStream());
    if (!error) {
      File file = SPIFFS.open("/erp-config.json", "w");
      serializeJson(doc, file);
      file.close();
    }
  }
  http.end();
}

