BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
void enviarAsistenciaAErp(const String& personaId, const String& nombre, const String& tipo, const String& metodo) {
  if (!SPIFFS.exists("/erp-config.json")) return;

  DynamicJsonDocument doc(4096);
  File file = SPIFFS.open("/erp-config.json", "r");
  DeserializationError error = deserializeJson(doc, file);
  file.close();
  if (error || !doc.is<JsonArray>()) return;

  JsonArray erps = doc.as<JsonArray>();
  for (JsonObject erp : erps) {
    if (!erp["activo"].as<bool>() || !erp["envioAuto"].as<bool>()) continue;

    String webhookUrl = erp["webhookUrl"].as<String>();
    if (webhookUrl.length() == 0) continue;

    String fieldMap = erp["fieldMap"].as<String>();
    DynamicJsonDocument payloadDoc(512);

    if (fieldMap != "{}" && fieldMap.length() > 2) {
      DynamicJsonDocument fmDoc(256);
      deserializeJson(fmDoc, fieldMap);
      JsonObject fm = fmDoc.as<JsonObject>();
      for (JsonPair kv : fm) {
        String key = kv.key().c_str();
        String val = kv.value().as<String>();
        if (key == "rut") payloadDoc[val] = buscarRutPersona(personaId);
        else if (key == "persona_id") payloadDoc[val] = personaId;
        else if (key == "nombre") payloadDoc[val] = nombre;
        else if (key == "tipo") payloadDoc[val] = tipo;
        else if (key == "metodo") payloadDoc[val] = metodo;
        else if (key == "fecha_hora") payloadDoc[val] = String(getTimestamp());
        else payloadDoc[key] = val;
      }
    } else {
      payloadDoc["persona_id"] = personaId;
      payloadDoc["nombre"] = nombre;
      payloadDoc["tipo"] = tipo;
      payloadDoc["metodo"] = metodo;
      payloadDoc["fecha_hora"] = String(getTimestamp());
    }

    String headersStr = erp["headers"].as<String>();
    HTTPClient http;
    http.begin(webhookUrl);
    http.addHeader("Content-Type", "application/json");
    if (headersStr != "{}" && headersStr.length() > 2) {
      DynamicJsonDocument hDoc(256);
      deserializeJson(hDoc, headersStr);
      for (JsonPair kv : hDoc.as<JsonObject>()) {
        String val = kv.value().as<String>();
        val.replace("TOKEN", ""); val.replace("API_KEY", ""); val.replace("SAP_KEY", "");
        if (val.length() > 0) http.addHeader(kv.key().c_str(), val);
      }
    }
    http.setTimeout(8000);

    String payloadStr;
    serializeJson(payloadDoc, payloadStr);
    int respCode = http.POST(payloadStr);
    addLog("ERP push: " + webhookUrl + " -> HTTP " + String(respCode));
    http.end();
    yield();
  }
}

String buscarRutPersona(const String& personaId) {
  DynamicJsonDocument doc(2048);
  JsonArray personas = loadArray("/personas.json", doc);
  for (JsonObject p : personas) {
    if (p["id"].as<String>() == personaId) return p["rut"].as<String>();
  }
  return "";
}

void sincronizarPendientes() {
  sincronizarTurnosPendientes();
  sincronizarAsignacionesPendientes();
  sincronizarAsistencias();
}

// ============================================================
// SPIFFS — JSON
// ============================================================
JsonArray loadArray(const char* path, DynamicJsonDocument& doc) {
  if (!SPIFFS.exists(path)) { doc.set(JsonArray()); return doc.as<JsonArray>(); }
  File file = SPIFFS.open(path, "r");
  if (!file) { doc.set(JsonArray()); return doc.as<JsonArray>(); }
  DeserializationError err = deserializeJson(doc, file);
  file.close();
  if (err || !doc.is<JsonArray>()) doc.set(JsonArray());
  return doc.as<JsonArray>();
}

void saveArray(const char* path, DynamicJsonDocument& doc) {
  File file = SPIFFS.open(path, "w");
  serializeJson(doc, file);
  file.close();
}

void initSPIFFS() {
  if (!SPIFFS.begin(true)) return;
  const char* files[] = { "/personas.json", "/turnos.json", "/asignaciones.json", "/asistencias.json", "/wifi.json" };
  for (auto f : files) {
    if (!SPIFFS.exists(f)) {
      File file = SPIFFS.open(f, "w");
      file.println(String(f) == "/wifi.json" ? "{\"ssid\":\"\",\"pass\":\"\",\"backend\":\"http://172.20.10.3:5000\",\"mqtt\":\"\",\"pin\":\"\"}" : "[]");
      file.close();
    }
  }
}

void loadWiFiConfig() {
  File file = SPIFFS.open("/wifi.json", "r");
  if (file) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, file);
    if (doc.containsKey("ssid")) savedSSID = doc["ssid"].as<String>();
    if (doc.containsKey("pass")) savedPASS = doc["pass"].as<String>();
    if (doc.containsKey("backend")) backendURL = doc["backend"].as<String>();
    if (doc.containsKey("mqtt")) mqttBroker = doc["mqtt"].as<String>();
    if (doc.containsKey("pin")) pinEnrol = doc["pin"].as<String>();
    file.close();
  }
}

void saveConfig(String ssid, String pass, String backend, String mqtt, String pin) {
  DynamicJsonDocument doc(512);
  doc["ssid"] = ssid; doc["pass"] = pass; doc["backend"] = backend; doc["mqtt"] = mqtt; doc["pin"] = pin;
  File file = SPIFFS.open("/wifi.json", "w");
  serializeJson(doc, file); file.close();
  savedSSID = ssid; savedPASS = pass; backendURL = backend; mqttBroker = mqtt; pinEnrol = pin;
}

void servirArchivo(const char* path, const char* tipo) {
  if (!SPIFFS.exists(path)) { server.send(404, "text/plain", "Archivo no encontrado"); return; }
  File f = SPIFFS.open(path, "r");
  server.streamFile(f, tipo);
  f.close();
  yield();
}

// ============================================================
// HANDLERS WEB
// ============================================================
void handleWiFiConfig() {
  actualizarBloqueoAsistencia(60000);
  String ssid    = server.hasArg("ssid")    && server.arg("ssid").length()    > 0 ? server.arg("ssid")    : savedSSID;
  String pass    = server.hasArg("pass")    && server.arg("pass").length()    > 0 ? server.arg("pass")    : savedPASS;
  String backend = server.hasArg("backend") && server.arg("backend").length() > 0 ? server.arg("backend") : backendURL;
  String mqtt    = server.hasArg("mqtt")    && server.arg("mqtt").length()    > 0 ? server.arg("mqtt")    : mqttBroker;
  String pin     = server.hasArg("pin")     && server.arg("pin").length()     > 0 ? server.arg("pin")     : pinEnrol;
  saveConfig(ssid, pass, backend, mqtt, pin);
  server.send(200, "text/plain", "Guardado. Reiniciando...");
  delay(1500); ESP.restart();
}

void handleRegisterUser() {
  if (!server.hasArg("name") || !server.hasArg("rut")) { server.send(400, "text/plain", "Faltan datos"); return; }
  ultimoErrorRegistro = "";
  rostroRegistroExitoso = false;
  actualizarBloqueoAsistencia(60000);
  nombreRegistrando = server.arg("name"); rutRegistrando = server.arg("rut"); emailRegistrando = server.arg("email");
  completarRegistroPersona();
  server.send(200, "text/plain", "OK: Mire a la camara...");
}

