BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
void handleCreateTurn() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("nombre") || !server.hasArg("inicio") || !server.hasArg("fin") || !server.hasArg("dias")) {
    server.send(400, "text/plain", "Datos incompletos");
    return;
  }
  DynamicJsonDocument doc(4096);
  JsonArray turnos = loadArray("/turnos.json", doc);
  JsonObject t = turnos.createNestedObject();

  String nombre = server.arg("nombre");
  String inicio = server.arg("inicio");
  String fin = server.arg("fin");
  String dias = server.arg("dias");
  String localId = "local-" + String(getTimestamp()) + "-" + String(turnos.size() + 1);
  String backendId = "";
  bool synced = crearTurnoEnBackend(nombre, inicio, fin, dias, backendId);

  t["id"] = synced && backendId.length() > 0 ? backendId : localId;
  t["backend_id"] = synced && backendId.length() > 0 ? backendId : "";
  t["nombre"] = nombre;
  t["inicio"] = inicio;
  t["fin"] = fin;
  t["dias"] = dias;
  t["sincronizado"] = synced;

  saveArray("/turnos.json", doc);
  server.send(200, "text/plain", synced ? "Turno creado y sincronizado" : "Turno creado local (pendiente sync)");
}

void handleAssignTurn() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("persona") || !server.hasArg("turno")) {
    server.send(400, "text/plain", "Falta persona o turno");
    return;
  }
  DynamicJsonDocument doc(4096);
  JsonArray asignaciones = loadArray("/asignaciones.json", doc);
  String personaId = server.arg("persona");
  String turnoId = server.arg("turno");

  for (JsonObject a : asignaciones) {
    if (a["persona_id"] == personaId) {
      server.send(400, "text/plain", "Persona ya tiene turno asignado");
      return;
    }
  }

  String backendAsignacionId = "";
  bool synced = false;
  String turnoBackendId = obtenerTurnoBackendId(turnoId);
  if (turnoBackendId.length() == 0 && isOnline) {
    sincronizarTurnosPendientes();
    turnoBackendId = obtenerTurnoBackendId(turnoId);
  }
  if (turnoBackendId.length() > 0) {
    synced = crearAsignacionEnBackend(personaId, turnoBackendId, backendAsignacionId);
  }

  JsonObject a = asignaciones.createNestedObject();
  a["persona_id"]       = personaId;
  a["turno_id"]         = turnoId;
  a["fecha_asignacion"] = getTimestamp();
  a["sincronizado"]     = synced;
  if (backendAsignacionId.length() > 0) a["backend_id"] = backendAsignacionId;
  saveArray("/asignaciones.json", doc);
  server.send(200, "text/plain", synced ? "Turno asignado y sincronizado" : "Turno asignado local (pendiente sync)");
}

void handleLimpiarDatos() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("codigo") || server.arg("codigo") != "1234") {
    server.send(403, "text/plain", "Codigo incorrecto");
    return;
  }
  const char* files[] = {"/personas.json", "/turnos.json", "/asignaciones.json", "/asistencias.json"};
  for (auto f : files) {
    File file = SPIFFS.open(f, "w");
    file.println("[]");
    file.close();
  }
  addLog("Sistema limpiado");
  server.send(200, "text/plain", "Sistema limpiado correctamente");
}

void handleSincronizar() {
  actualizarBloqueoAsistencia();
  if (!isOnline) { server.send(503, "text/plain", "Sin conexion"); return; }
  sincronizarPendientes();
  sincronizarPersonasDesdeBackend();
  sincronizarTurnosDesdeBackend();
  sincronizarAsignacionesDesdeBackend();
  server.send(200, "text/plain", "Sincronizacion ejecutada");
}

void handleFetchPersonas() {
  actualizarBloqueoAsistencia();
  if (!isOnline) { server.send(503, "text/plain", "Sin conexion WiFi"); return; }
  sincronizarPersonasDesdeBackend();
  server.send(200, "text/plain", "Personas obtenidas. Revisa los logs.");
}

void handleSetBackend() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("url")) { server.send(400, "text/plain", "Falta url"); return; }
  backendURL = server.arg("url");
  addLog("Backend actualizado: " + backendURL);
  server.send(200, "text/plain", "Backend: " + backendURL);
}

void handleEditarPersona() {
  actualizarBloqueoAsistencia(60000);
  if (!server.hasArg("id") || !server.hasArg("name")) {
    server.send(400, "text/plain", "Faltan id o name");
    return;
  }

  String id = server.arg("id");
  String nuevoNombre = server.arg("name");
  String nuevoEmail = server.hasArg("email") ? server.arg("email") : "";
  nuevoNombre.trim();
  nuevoEmail.trim();

  if (nuevoNombre.length() == 0) {
    server.send(400, "text/plain", "Nombre invalido");
    return;
  }

  DynamicJsonDocument doc(4096);
  JsonArray arr = loadArray("/personas.json", doc);
  JsonObject objetivo;
  bool encontrado = false;
  for (JsonObject p : arr) {
    if (p["id"].as<String>() == id) {
      objetivo = p;
      encontrado = true;
      break;
    }
  }

  if (!encontrado) {
    server.send(404, "text/plain", "Persona no encontrada local");
    return;
  }

  objetivo["nombre"] = nuevoNombre;
  objetivo["email"] = nuevoEmail;
  objetivo["sincronizado"] = false;

  bool synced = false;
  if (isOnline && WiFi.status() == WL_CONNECTED && !id.startsWith("local-")) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/personas/" + id);
    http.addHeader("Content-Type", "application/json");


    DynamicJsonDocument payloadDoc(512);
    payloadDoc["nombre"] = nuevoNombre;
    payloadDoc["email"] = nuevoEmail;
    String payload;
    serializeJson(payloadDoc, payload);

    int code = http.sendRequest("PATCH", payload);
    if (code == 200) {
      synced = true;
      objetivo["sincronizado"] = true;
      addLog("Persona editada y sincronizada: " + id);
    } else {
      addLog("Edicion local OK, backend pendiente. Codigo: " + String(code));
    }
    http.end();
  } else {
    addLog("Edicion local guardada (sin backend disponible)");
  }

  saveArray("/personas.json", doc);
  server.send(200, "text/plain", synced ? "Persona actualizada y sincronizada" : "Persona actualizada local (pendiente sync)");
}

void handleActualizarRostroPersona() {
  actualizarBloqueoAsistencia(60000);
  if (!server.hasArg("id")) {
    server.send(400, "text/plain", "Falta id");
    return;
  }
  if (estadoActual != ESTADO_IDLE) {
    server.send(409, "text/plain", "Sistema ocupado, intente de nuevo");
    return;
  }

  String id = server.arg("id");
  if (id.startsWith("local-")) {
    server.send(409, "text/plain", "Persona local sin ID remoto, sincronice primero");
    return;
  }
  if (!isOnline || WiFi.status() != WL_CONNECTED) {
    server.send(503, "text/plain", "Sin conexion para actualizar rostro");
    return;
  }

  modoEdicionRostro = true;
  personaEditandoId = id;
  idParaRostro = id;
  intentosFacial = 0;
  rostroRegistroExitoso = false;
  ultimoErrorRegistro = "";
  estadoActual = ESTADO_REGISTRO_FACIAL;
  tiempoUltimoEstado = millis();

