BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
  server.send(200, "text/plain", "Mire a la camara para actualizar rostro");
}

void handleBorrarPersona() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("id")) { server.send(400, "text/plain", "Falta ID"); return; }
  String id = server.arg("id");

  if (isOnline && WiFi.status() == WL_CONNECTED && !id.startsWith("local-")) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/personas/" + id);
    int httpCode = http.sendRequest("DELETE");
    if (httpCode == 200) {
      addLog("Persona borrada en BD remota OK");
    } else {
      addLog("Error borrando persona remota (Cod: " + String(httpCode) + ")");
    }
    http.end();
  }

  DynamicJsonDocument doc(2048);
  JsonArray arr = loadArray("/personas.json", doc);
  for (JsonArray::iterator it = arr.begin(); it != arr.end(); ++it) {
    if ((*it)["id"].as<String>() == id) {
      arr.remove(it);
      saveArray("/personas.json", doc);
      server.send(200, "text/plain", "Persona eliminada");
      return;
    }
  }
  server.send(404, "text/plain", "Persona no encontrada localmente");
}

void handleBorrarTurno() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("id")) { server.send(400, "text/plain", "Falta ID"); return; }
  String id = server.arg("id");

  if (isOnline && WiFi.status() == WL_CONNECTED && !id.startsWith("local-")) {
    HTTPClient http;
  beginHttp(http, backendURL + "/api/turnos/" + id);
    int httpCode = http.sendRequest("DELETE");
    if (httpCode == 200) addLog("Turno borrado en BD remota OK");
    else addLog("Error borrando turno remoto (Cod: " + String(httpCode) + ")");
    http.end();
  }

  DynamicJsonDocument doc(1024);
  JsonArray arr = loadArray("/turnos.json", doc);
  for (JsonArray::iterator it = arr.begin(); it != arr.end(); ++it) {
    if ((*it)["id"].as<String>() == id) {
      arr.remove(it);
      saveArray("/turnos.json", doc);
      server.send(200, "text/plain", "Turno eliminado");
      return;
    }
  }
  server.send(404, "text/plain", "Turno no encontrado");
}

void handleBorrarAsignacion() {
  actualizarBloqueoAsistencia();
  if (!server.hasArg("persona") || !server.hasArg("turno")) { server.send(400, "text/plain", "Faltan datos"); return; }
  String persona = server.arg("persona");
  String turno = server.arg("turno");

  DynamicJsonDocument doc(1024);
  JsonArray arr = loadArray("/asignaciones.json", doc);

  for (JsonArray::iterator it = arr.begin(); it != arr.end(); ++it) {
    if ((*it)["persona_id"].as<String>() == persona && (*it)["turno_id"].as<String>() == turno) {

      String backendId = (*it).containsKey("backend_id") ? (*it)["backend_id"].as<String>() : "";

      if (isOnline && WiFi.status() == WL_CONNECTED && backendId.length() > 0) {
        HTTPClient http;
  beginHttp(http, backendURL + "/api/asignaciones/" + backendId);
        int httpCode = http.sendRequest("DELETE");
        if (httpCode == 200) addLog("Asignacion borrada en BD remota OK");
        else addLog("Error borrando asignacion remota (Cod: " + String(httpCode) + ")");
        http.end();
      }

      arr.remove(it);
      saveArray("/asignaciones.json", doc);
      server.send(200, "text/plain", "Asignacion eliminada");
      return;
    }
  }
  server.send(404, "text/plain", "Asignacion no encontrada");
}

void handleUltimoRegistro() {
  actualizarBloqueoAsistencia();
    DynamicJsonDocument doc(2048);
    JsonArray personas = loadArray("/personas.json", doc);
    if (personas.size() == 0) {
        server.send(404, "application/json", "{\"error\": \"No hay registros\"}");
        return;
    }
    JsonObject lastP = personas[personas.size() - 1];
    String json = "{";
    json += "\"id\":\"" + lastP["id"].as<String>() + "\",";
    json += "\"nombre\":\"" + lastP["nombre"].as<String>() + "\",";
    json += "\"rut\":\"" + lastP["rut"].as<String>() + "\",";
    json += "\"imagen_url\":\"" + lastCapturedImageUrl + "\"";
    json += "}";
    server.send(200, "application/json", json);
}

void handleGetPersonas() { actualizarBloqueoAsistencia(); servirArchivo("/personas.json", "application/json"); }
void handleGetTurnos() { actualizarBloqueoAsistencia(); servirArchivo("/turnos.json", "application/json"); }
void handleGetAsignaciones() { actualizarBloqueoAsistencia(); servirArchivo("/asignaciones.json", "application/json"); }
void handleGetAsistencias() { actualizarBloqueoAsistencia(); servirArchivo("/asistencias.json", "application/json"); }

void WiFiEvent(arduino_event_id_t event, arduino_event_info_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      addLog("WiFi: Conectado al AP");
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      wifiUptimeStart = millis();
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED: {
      if (!wifiEstabaConectado) break;
      wifiDisconnectCount++;
      uint8_t reason = info.wifi_sta_disconnected.reason;
      char buf[64];
      snprintf(buf, sizeof(buf), "WiFi: Desconectado (razon %d, contador %d)", reason, wifiDisconnectCount);
      wifiDisconnectReason = String(buf);
      addLog(wifiDisconnectReason);
      break;
    }
    default: break;
  }
}

// ============================================================
// SETUP
// ============================================================
void setup() {
  pinMode(PIR_PIN, INPUT_PULLDOWN);
  addLog("Calibrando sensor PIR...");
  delay(3000);
  pinMode(13, INPUT_PULLUP);
  pinMode(FLASH_PIN, OUTPUT);
  digitalWrite(FLASH_PIN, LOW);
  if (digitalRead(13) == LOW) {
    delay(1000);
    if (digitalRead(13) == LOW) {
      initSPIFFS(); saveConfig("", "", backendURL, mqttBroker, ""); Serial.println("RESET DETECTADO");
    }
  }

  Serial.begin(115200); delay(1000);

  WiFi.onEvent(WiFiEvent);

  initCamera(); delay(500);

  initSPIFFS(); delay(500); loadWiFiConfig(); tryConnectWiFi();

  if (isOnline) {
    sincronizarPendientes();
    sincronizarPersonasDesdeBackend();
    sincronizarTurnosDesdeBackend();
    sincronizarAsignacionesDesdeBackend();
  } else {
    WiFi.mode(WIFI_AP); WiFi.softAP(apSSID, apPASS, 1, 0, 4);
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
  }

  // Rutas HTML
  server.on("/", []() { actualizarBloqueoAsistencia(); servirArchivo("/index.html", "text/html"); });
  server.on("/register", []() { actualizarBloqueoAsistencia(60000); servirArchivo("/register.html", "text/html"); });
  server.on("/gestion", []() { actualizarBloqueoAsistencia(); servirArchivo("/gestion.html", "text/html"); });
  server.on("/personas", []() { actualizarBloqueoAsistencia(); servirArchivo("/personas.html", "text/html"); });
  server.on("/asistencias", []() { actualizarBloqueoAsistencia(); servirArchivo("/asistencias.html", "text/html"); });
  server.on("/turnos", []() { actualizarBloqueoAsistencia(); servirArchivo("/turnos.html", "text/html"); });
  server.on("/asignaciones", []() { actualizarBloqueoAsistencia(); servirArchivo("/asignaciones.html", "text/html"); });
  server.on("/wifi-setup", []() { actualizarBloqueoAsistencia(60000); servirArchivo("/wifi-setup.html", "text/html"); });
  server.on("/logs", []() { servirArchivo("/logs.html", "text/html"); });

  // Rutas de Accion
  server.on("/wifi-config", handleWiFiConfig);
  server.on("/registrar", handleRegisterUser);
  server.on("/crear_turno", handleCreateTurn);
  server.on("/asignar", handleAssignTurn);
  server.on("/limpiar", handleLimpiarDatos);
  server.on("/sincronizar", handleSincronizar);
  server.on("/fetch-personas", handleFetchPersonas);
  server.on("/set-backend", handleSetBackend);
  server.on("/editar_persona", handleEditarPersona);
  server.on("/actualizar_rostro", handleActualizarRostroPersona);
  server.on("/borrar_persona", handleBorrarPersona);
  server.on("/borrar_turno", handleBorrarTurno);
  server.on("/borrar_asignacion", handleBorrarAsignacion);

  // Rutas API REST
  server.on("/api/personas", handleGetPersonas);
  server.on("/api/turnos", handleGetTurnos);
  server.on("/api/asignaciones", handleGetAsignaciones);
  server.on("/api/asistencias", handleGetAsistencias);
  server.on("/api/logs", []() {
    String contenido = logBuffer;
    if (contenido.length() == 0) contenido = "Sin logs disponibles";
    server.send(200, "text/html", contenido);
  });
  server.on("/api/logs/clear", []() {
    logBuffer = "";
    server.send(200, "text/plain", "Logs limpiados");
  });
  server.on("/ultimo_registro", handleUltimoRegistro);

  server.on("/estado", []() {
    String referer = server.header("Referer");
    if (referer.indexOf("/register") >= 0 || referer.indexOf("/wifi-setup") >= 0 ||
        (referer.indexOf("/gestion") >= 0 && estadoActual != ESTADO_IDLE)) {
      actualizarBloqueoAsistencia();
    }

    DynamicJsonDocument docPersonas(2048);
    DynamicJsonDocument docAsignaciones(1024);
    DynamicJsonDocument docAsistencias(2048);
    JsonArray personas = loadArray("/personas.json", docPersonas);
    JsonArray asignaciones = loadArray("/asignaciones.json", docAsignaciones);
    JsonArray asistencias = loadArray("/asistencias.json", docAsistencias);
    String motivoAuto = motivoAsistenciaAutomatica(millis());

    String json = "{";
    json += "\"estado\":\""  + String(estadoActual == ESTADO_IDLE ? "idle" : "ocupado") + "\",";
    json += "\"codigo_paso\":" + String(estadoActual) + ",";
    json += "\"intentos_facial\":" + String(intentosFacial) + ",";
    json += "\"online\":"    + String(isOnline ? "true" : "false") + ",";
    json += "\"camara\":"    + String(camaraIniciada ? "true" : "false") + ",";
    json += "\"rostro_ok\":" + String(rostroRegistroExitoso ? "true" : "false") + ",";
    json += "\"error_registro\":\"" + jsonEscape(ultimoErrorRegistro) + "\",";
    json += "\"asistencia_bloqueada\":" + String(millis() < bloqueoAsistenciaHasta ? "true" : "false") + ",";
    json += "\"bloqueo_restante_ms\":" + String(millis() < bloqueoAsistenciaHasta ? (bloqueoAsistenciaHasta - millis()) : 0) + ",";
    json += "\"asistencia_auto_huella_habilitada\":" + String(motivoAuto == "habilitada" ? "true" : "false") + ",";
    json += "\"motivo_asistencia_auto\":\"" + motivoAuto + "\",";
    json += "\"personas_locales\":" + String(personas.size()) + ",";
    json += "\"asignaciones_locales\":" + String(asignaciones.size()) + ",";
    json += "\"asistencias_locales\":" + String(asistencias.size()) + ",";
    json += "\"backend\":\"" + backendURL + "\",";
    json += "\"mqtt\":\""    + mqttBroker + "\",";
    json += "\"ssid\":\""    + jsonEscape(savedSSID) + "\",";
    json += "\"enrolado\":"  + String(estaEnrolado ? "true" : "false") + ",";
    json += "\"mac\":\""     + deviceMAC + "\"";
    json += "}";
    server.send(200, "application/json", json);
  });

  server.on("/wifi-diag", []() {
    String json = "{";
    json += "\"online\":" + String(isOnline ? "true" : "false") + ",";
    json += "\"ssid\":\"" + jsonEscape(savedSSID) + "\",";
    json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
    json += "\"ip\":\"" + (WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : "—") + "\",";
    json += "\"mac\":\"" + deviceMAC + "\",";
    String canal = "N/A";
    if (isOnline) canal = String(WiFi.channel());
    json += "\"canal\":" + canal + ",";
    json += "\"disconnects\":" + String(wifiDisconnectCount) + ",";
    json += "\"last_disconnect_reason\":\"" + jsonEscape(wifiDisconnectReason) + "\",";
    unsigned long uptime = (wifiUptimeStart > 0 && isOnline) ? (millis() - wifiUptimeStart) / 1000 : 0;
    json += "\"wifi_uptime_seg\":" + String(uptime) + ",";
    json += "\"heap_free\":" + String(ESP.getFreeHeap()) + ",";
    json += "\"uptime_total_seg\":" + String(millis() / 1000);
    json += "}";
    server.send(200, "application/json", json);
  });

  server.begin();
  addLog("Sistema web iniciado.");
}

