BorgTb/AsistenciaBackendFinal/esp32-cam/esp32-sin-lector/esp32-sin-lector.ino
// ============================================================
// LOOP PRINCIPAL
// ============================================================
void loop() {
  server.handleClient();
  yield();

  if (savedSSID.length() > 0) verificarConexionWiFi();

  if (isOnline && mqtt_client == NULL) mantenerConexionMQTT();
  unsigned long ahora = millis();

  if (estadoActual != ESTADO_IDLE && estadoActual != ESTADO_PROCESANDO_ASISTENCIA && (ahora - tiempoUltimoEstado) > TIMEOUT_REGISTRO) {
    addLog("Timeout de registro. Volviendo a inactivo.");
    digitalWrite(FLASH_PIN, LOW);
    estadoActual = ESTADO_IDLE;
  }

  // ==========================================================
  // LOGICA DE ASISTENCIA FACIAL POR DEMANDA (CONTROLADA POR PIR)
  // ==========================================================
  if (estadoActual == ESTADO_IDLE) {
    String motivoAuto = motivoAsistenciaAutomatica(ahora);
    if (!isOnline && motivoAuto != "habilitada" && (ahora - ultimoLogDiagnosticoOffline) > 15000) {
      ultimoLogDiagnosticoOffline = ahora;
      addLog("[OFFLINE] Auto-asistencia inactiva: " + motivoAuto);
    }

    static unsigned long tiempoUltimoMovimiento = 0;
    static bool hayAlguienFrenteAlSensor = false;

    if (digitalRead(PIR_PIN) == HIGH) {
      if (!hayAlguienFrenteAlSensor) {
        addLog("Movimiento detectado. Estabilizando voltaje para camara...");
        hayAlguienFrenteAlSensor = true;
        tiempoUltimoMovimiento = ahora;

        delay(800);
        return;
      }
      tiempoUltimoMovimiento = ahora;
    }

    if (hayAlguienFrenteAlSensor) {

      if (ahora - tiempoUltimoMovimiento > 15000) {
          addLog("Falsa alarma o abandono. Sistema vuelve a reposo absoluto.");
          hayAlguienFrenteAlSensor = false;
          return;
      }

      if (isOnline && (ahora - cooldownAsistencia > COOLDOWN_TIEMPO) && (ahora - lastFaceCheck > FACE_CHECK_INTERVAL)) {
        lastFaceCheck = ahora;
        String personaIdEncontrada = identificarPorRostro();
        if (personaIdEncontrada != "" && personaIdEncontrada != "unknown") {
            estadoActual = ESTADO_PROCESANDO_ASISTENCIA;
            String res = procesarAsistencia(personaIdEncontrada, "facial");
            addLog(res);
            if (resultadoAsistenciaExitosa(res)) flashExito(); else flashError();
            cooldownAsistencia = millis();
            hayAlguienFrenteAlSensor = false;

            estadoActual = ESTADO_IDLE;
        }
      }
    }
  }

  // ==========================================================
  // FLUJO DE REGISTRO FACIAL
  // ==========================================================
  if (estadoActual == ESTADO_REGISTRO_FACIAL) {
    static unsigned long ultimoIntentoFoto = 0;
    if (ahora - ultimoIntentoFoto > 4000) {
      ultimoIntentoFoto = ahora;
      intentosFacial++;
      if (intentosFacial > 6) {
        digitalWrite(FLASH_PIN, LOW);
        flashError();
        addLog("Se alcanzo el limite de intentos faciales. Volviendo a menu.");
        ultimoErrorRegistro = "No se pudo registrar rostro tras multiples intentos";
        estadoActual = ESTADO_IDLE;
        nombreRegistrando = ""; rutRegistrando = ""; emailRegistrando = "";
        idParaRostro = "";
        modoEdicionRostro = false;
        personaEditandoId = "";
      } else {
        addLog("Enviando fotografia #" + String(intentosFacial) + " para registro...");
        if (!registrarRostroEnBackend(idParaRostro)) {
          addLog("No se pudo enviar foto por MQTT. Reintentando...");
          if (mqtt_client == NULL && mqttBroker != "") mantenerConexionMQTT();
        }
      }
    }
  }

  if (mqttConnected && mqtt_client != NULL && (ahora - lastHeartbeat) > 30000UL) {
    lastHeartbeat = ahora;
    String topic = "esp32/heartbeat/" + deviceMAC;
    String payload = "{\"mac\":\"" + deviceMAC + "\",\"t\":" + String(millis()) + ",\"ip\":\"" + WiFi.localIP().toString() + "\"}";
    esp_mqtt_client_publish(mqtt_client, topic.c_str(), payload.c_str(), 0, 0, 0);
  }

  static unsigned long lastSync = 0;
  if (isOnline && (ahora - lastSync) > 300000UL) {
    lastSync = ahora;
    sincronizarPendientes();
  }

  static unsigned long lastErpSync = 0;
  if (isOnline && (ahora - lastErpSync) > 360000UL) {
    lastErpSync = ahora;
    sincronizarErpConfigDesdeBackend();
  }

  delay(20);
}
